<a href="https://colab.research.google.com/github/mitsu666/DataScienceLecture/blob/master/DataScienceLecture3_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#2. PANDAS基礎(前編)

In [0]:
#今後の作業のためインポートしておく。ここからはnumpyも一緒にインポートしておく
import pandas as pd
import numpy as np

##2.2. シリーズ（SERIES）

In [2]:
#さっき使用したリストをageリストとして渡すしpdモジュールのSeriesメソッドでシリーズ化する
age = pd.Series([21,33,17,24])
print (age)

0    21
1    33
2    17
3    24
dtype: int64

In [4]:
#ageのvalues値でnumpy配列になっているものを取得
print (type(age.values))
print (age.values)

#index値でインデックスを取得
print (age.index)

<class 'numpy.ndarray'>
[21 33 17 24]
RangeIndex(start=0, stop=4, step=1)

In [5]:
#各データを特定するためのインデックスをAさんBさんとか名前にする。
age2=pd.Series([21,33,17,24],index=['A','B','C','D'])
#値を確認
print (age2)
#indexを確認
print (age2.index)

A    21
B    33
C    17
D    24
dtype: int64
Index(['A', 'B', 'C', 'D'], dtype='object')

In [6]:
#NumPyの配列と違って、１つの値や複数の値を参照するときにインデックスのラベルを使って指定することができる。
#Aさんの年齢
print (age2['A'])
#B
print (age2['B'])

21
33

In [7]:
#Cは実は20歳だった
age2['C']=20
print (age2)

A    21
B    33
C    20
D    24
dtype: int64

In [8]:
#numpy関数も適用可能
#exp
print (np.exp(age2))
#log
print (np.log(age2))

A    1.318816e+09
B    2.146436e+14
C    4.851652e+08
D    2.648912e+10
dtype: float64
A    3.044522
B    3.496508
C    2.995732
D    3.178054
dtype: float64

In [9]:
#Pythonのディクショナリ形式のデータがある場合、それを使ってシリーズを作成することができる。
#都心の人口(万)
sdata = {'Tokyo':927.3,'Kanagawa':905.8,'Saitama':730.8,'Chiba':627.8}
pop=pd.Series(sdata)

print (pop)

Tokyo       927.3
Kanagawa    905.8
Saitama     730.8
Chiba       627.8
dtype: float64

In [10]:
#順を並べ替える。
cities=['Tochigi','Tokyo','Saitama','Kanagawa']

pop2 = pd.Series(sdata,index=cities)

print (pop2)

Tochigi       NaN
Tokyo       927.3
Saitama     730.8
Kanagawa    905.8
dtype: float64

In [11]:
#足すと片方になくても補完する
print (pop)
print (pop2)

print (pop+pop2)

Tokyo       927.3
Kanagawa    905.8
Saitama     730.8
Chiba       627.8
dtype: float64
Tochigi       NaN
Tokyo       927.3
Saitama     730.8
Kanagawa    905.8
dtype: float64
Chiba          NaN
Kanagawa    1811.6
Saitama     1461.6
Tochigi        NaN
Tokyo       1854.6
dtype: float64

In [12]:
#シリーズのインデックスは代入して置き換えることができる。
age.index = ['A','B','C','D']
print (age)

A    21
B    33
C    17
D    24
dtype: int64

##2.3. データフレーム（DATAFRAME）

###2.3.1. 辞書から作成

In [0]:
#辞書を以下のようにまず作成 NPB2000-20003年、日本一になった球団とその時の勝率
data={'team':['Giants','Swallows','Giants','Buffaloes','Lions','Tigers'],
            'year':[2000,2001,2002,2001,2002,2003],
            'win':[0.578,0.567,0.623,0.565,0.647,0.630]}

#pdモジュールのDataFrameメソッドに辞書を渡して作成
baseball = pd.DataFrame(data)

In [14]:
#自動的にインデックスが代入される。
print (baseball)

#大きなデータフレームの場合、headメソッドを使うと最初の５行だけが抽出される。
print (baseball.head())
#3行みたいとき
print (baseball.head(3))

#下からみたいとき
print (baseball.tail())
#下から3行
print (baseball.tail(3))

        team  year    win
0     Giants  2000  0.578
1   Swallows  2001  0.567
2     Giants  2002  0.623
3  Buffaloes  2001  0.565
4      Lions  2002  0.647
5     Tigers  2003  0.630
        team  year    win
0     Giants  2000  0.578
1   Swallows  2001  0.567
2     Giants  2002  0.623
3  Buffaloes  2001  0.565
4      Lions  2002  0.647
       team  year    win
0    Giants  2000  0.578
1  Swallows  2001  0.567
2    Giants  2002  0.623
        team  year    win
1   Swallows  2001  0.567
2     Giants  2002  0.623
3  Buffaloes  2001  0.565
4      Lions  2002  0.647
5     Tigers  2003  0.630
        team  year    win
3  Buffaloes  2001  0.565
4      Lions  2002  0.647
5     Tigers  2003  0.630

In [15]:
#列の順番を指定して作成する同じく辞書から
pd.DataFrame(data,columns=['year','team','win'])

#指定した列がデータを持っていない場合、欠損値が代入される。
baseball2 = pd.DataFrame(data,columns=['year','team','win','lose'],
                                          index=['one','two','three','four','five','six'])

print (baseball2)

       year       team    win lose
one    2000     Giants  0.578  NaN
two    2001   Swallows  0.567  NaN
three  2002     Giants  0.623  NaN
four   2001  Buffaloes  0.565  NaN
five   2002      Lions  0.647  NaN
six    2003     Tigers  0.630  NaN

###2.3.2. SERIESから作成

In [16]:
#シリーズ定義
s = pd.Series(np.arange(5))
#DataFrameメソッドでデータフレーム作成
df = pd.DataFrame(s)
print (df)

   0
0  0
1  1
2  2
3  3
4  4

###2.3.3. VALUEにシリーズを持つ辞書から作成

In [17]:
#0-5のseries
s1 = pd.Series(np.arange(5))
#0-5の2倍のseries
s2 = pd.Series(np.arange(5)*2)
#辞書
dic = {'A':s1,'B':s2}
#辞書からデータフレーム作成
print (pd.DataFrame(dic))

   A  B
0  0  0
1  1  2
2  2  4
3  3  6
4  4  8

###2.3.4. NUMPY2次元配列から作成

In [18]:
#GDP/一人当たりGDP (100万ドル)
data = np.array([[4892255,38313],
                [1281330,1085],
                [510504,2246],
                [931405,19343],
                [475094	,18853],
                 [188261	,40793],
                  [272429	,4043],
                  [4416104,	3360],
                  [730325	,9881],
                  [146068	,825],
                  [79568	,497],
                  [167479	,1854],
                  [215354	,30843],
                  [221437	,8197]])

pd.DataFrame(data,columns=['GDP','GDP/pop'],
             index=['日本' ,'インド' ,'インドネシア','韓国', 'サウジアラビア','シンガポール', 'タイ',
'中国','トルコ', 'パキスタン','バングラデシュ', 'フィリピン','香港', 'マレーシア'])

             GDP  GDP/pop
日本       4892255    38313
インド      1281330     1085
インドネシア    510504     2246
韓国        931405    19343
サウジアラビア   475094    18853
シンガポール    188261    40793
タイ        272429     4043
中国       4416104     3360
トルコ       730325     9881
パキスタン     146068      825
バングラデシュ    79568      497
フィリピン     167479     1854
香港        215354    30843
マレーシア     221437     8197

##2.4. CSVやTXTファイルなどから読み込む

In [21]:
#csvから読み込む
pd.read_csv('train.csv')

#csvから読む pd.read_tableで読み込む sep=separate(区切り)指定
pd.read_table('train.csv',sep=',')

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [22]:
#読み込んだものをデータフレームオブジェクト変数に代入
titanic = pd.read_csv('train.csv')
print (titanic)

#header(カラム名))何もしないと先頭を自動で指定する
print (pd.read_csv('train.csv').head(2))

#header無し、csvにカラム名がある場合そこがデータフレームの1行目となる
print (pd.read_csv('train.csv',header=None).head(2))

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]
   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]
            0         1       2   ...    9      10        11
0  PassengerId  Survived  Pclass  ...  Fare  Cabin  Embarked
1            1         0       3  ...  7.25    NaN         S

[2 rows x 12 columns]

In [23]:
#いらない行を除く
print (pd.read_csv('train.csv',skiprows=[1,3,5,7]))

#先頭の指定行のみ読み込む
print (pd.read_csv('train.csv',nrows=10))

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              2         1       1  ...  71.2833   C85         C
1              4         1       1  ...  53.1000  C123         S
2              6         0       3  ...   8.4583   NaN         Q
3              8         0       3  ...  21.0750   NaN         S
4              9         1       3  ...  11.1333   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
882          887         0       2  ...  13.0000   NaN         S
883          888         1       1  ...  30.0000   B42         S
884          889         0       3  ...  23.4500   NaN         S
885          890         1       1  ...  30.0000  C148         C
886          891         0       3  ...   7.7500   NaN         Q

[887 rows x 12 columns]
   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

####補足 絶対パスの調べ方

##2-5 参照方法

In [24]:
#titanicをサンプルデータとして読み込む
titanic = pd.read_csv('train.csv')
print (titanic)

#サンプルデータとしてGDP/一人当たりGDP (100万ドル)作成
data = np.array([[4892255,38313],
                [1281330,1085],
                [510504,2246],
                [931405,19343],
                [475094	,18853],
                 [188261	,40793],
                  [272429	,4043],
                  [4416104,	3360],
                  [730325	,9881],
                  [146068	,825],
                  [79568	,497],
                  [167479	,1854],
                  [215354	,30843],
                  [221437	,8197]])

gdp = pd.DataFrame(data,columns=['GDP','GDP/pop'],
             index=['日本' ,'インド' ,'インドネシア','韓国', 'サウジアラビア','シンガポール', 'タイ',
'中国','トルコ', 'パキスタン','バングラデシュ', 'フィリピン','香港', 'マレーシア'])

baseball = pd.DataFrame(data)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

###2.5.1. 列名指定

In [25]:
#列を名前で指定できる。でてきたものはシリーズになる
titanic['Fare']

#gdpのGDP
gdp['GDP']

#.以下列名でも取得できる
titanic.Fare

#.以下列名でも取得できる
gdp.GDP

日本         4892255
インド        1281330
インドネシア      510504
韓国          931405
サウジアラビア     475094
シンガポール      188261
タイ          272429
中国         4416104
トルコ         730325
パキスタン       146068
バングラデシュ      79568
フィリピン       167479
香港          215354
マレーシア       221437
Name: GDP, dtype: int64

###2.5.2. LOCで指定

In [26]:
#列名で取得 locという属性を使用 行はスライスの全部を意味する:を指定
#Fare列指定
titanic.loc[:,'Fare']

#列名で取得 locという属性を使用 行はスライスの全部を意味する:を指定
#year列を取得
gdp.loc[:,'GDP']

日本         4892255
インド        1281330
インドネシア      510504
韓国          931405
サウジアラビア     475094
シンガポール      188261
タイ          272429
中国         4416104
トルコ         730325
パキスタン       146068
バングラデシュ      79568
フィリピン       167479
香港          215354
マレーシア       221437
Name: GDP, dtype: int64

In [27]:
#行名で取得 locという属性を使用 列はスライスの全部を意味する:を指定
#100行目を指定
titanic.loc[100,:]

#行名で取得 locという属性を使用 列はスライスの全部を意味する:を指定
#シンガポールを指定
gdp.loc['シンガポール',:]

GDP        188261
GDP/pop     40793
Name: シンガポール, dtype: int64

###2.5.3. ILOCで指定

In [28]:
#iloc で 3列目を指定、指定しない行は:とする
titanic.iloc[:,2]

#iloc で 2列目を指定、指定しない行は:とする
gdp.iloc[:,1]

日本         38313
インド         1085
インドネシア      2246
韓国         19343
サウジアラビア    18853
シンガポール     40793
タイ          4043
中国          3360
トルコ         9881
パキスタン        825
バングラデシュ      497
フィリピン       1854
香港         30843
マレーシア       8197
Name: GDP/pop, dtype: int64

In [29]:
#iloc で 100行目を指定、指定しない列は:とする
titanic.iloc[100,:]

#iloc で 3行目を指定、指定しない列は:とする
gdp.iloc[3,:]

GDP        931405
GDP/pop     19343
Name: 韓国, dtype: int64

###2.5.4. 行列双方指定

In [30]:
# titanic 3行4列目指定  
print (titanic.iloc[3,4])

#gdpのシンガポール一人当たりGDP
print (gdp.loc['シンガポール','GDP/pop'])

female
40793

In [31]:
#5列目(4番地)から9列目(8番地まで)
print (titanic.iloc[:,4:9])

#2行目(1番地)から4列目(3番地まで)
print (titanic.iloc[1:4,:])

#5列目(4番地)から9列目(8番地まで) 2行目(1番地)から4列目(3番地まで)
print (titanic.iloc[1:4,4:9])

        Sex   Age  SibSp  Parch            Ticket
0      male  22.0      1      0         A/5 21171
1    female  38.0      1      0          PC 17599
2    female  26.0      0      0  STON/O2. 3101282
3    female  35.0      1      0            113803
4      male  35.0      0      0            373450
..      ...   ...    ...    ...               ...
886    male  27.0      0      0            211536
887  female  19.0      0      0            112053
888  female   NaN      1      2        W./C. 6607
889    male  26.0      0      0            111369
890    male  32.0      0      0            370376

[891 rows x 5 columns]
   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S

[3 rows x 12 columns]
      Sex   Age  SibSp  Parch            Ticket
1  female  38.0      1      0          PC 17599
2  female  26.0      0      0  STON/O2. 3101282
3  female  35.0      1      0            113803

###2.5.6. 値を参照

In [32]:
#valiue属性参照
print (gdp.values)

[[4892255   38313]
 [1281330    1085]
 [ 510504    2246]
 [ 931405   19343]
 [ 475094   18853]
 [ 188261   40793]
 [ 272429    4043]
 [4416104    3360]
 [ 730325    9881]
 [ 146068     825]
 [  79568     497]
 [ 167479    1854]
 [ 215354   30843]
 [ 221437    8197]]

##2.6. PANDASのその他の重要な機能

###2.6.1. 軸から要素を削除する

In [33]:
#dropメソッドを使って指定した要素を軸から削除する。
s = pd.Series(np.arange(5.),index=['A','B','C','D','E'])

print (s)

A    0.0
B    1.0
C    2.0
D    3.0
E    4.0
dtype: float64

In [34]:
#D行落とす
new_s = s.drop('D')
print (new_s)

#AとD行落とす
s.drop(['A','D'])

#S自体は不変
print (s)

A    0.0
B    1.0
C    2.0
E    4.0
dtype: float64
A    0.0
B    1.0
C    2.0
D    3.0
E    4.0
dtype: float64

In [35]:
#pandas データフレームの場合
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                                    index=['Tokyo','Kanagawa','Saitama','Chiba'],
                                    columns=['one','two','three','four'])

print (data)

          one  two  three  four
Tokyo       0    1      2     3
Kanagawa    4    5      6     7
Saitama     8    9     10    11
Chiba      12   13     14    15

In [36]:
#神奈川と東京列落とす
print (data.drop(['Kanagawa','Tokyo']))

#列を落とす。
#twoという列と落とすにはaxis=1オプション付ける
print (data.drop('two',axis=1))

         one  two  three  four
Saitama    8    9     10    11
Chiba     12   13     14    15
          one  three  four
Tokyo       0      2     3
Kanagawa    4      6     7
Saitama     8     10    11
Chiba      12     14    15

In [38]:
#two four 落とすにはリストでくくる
print (data.drop(['two','four'],axis=1))

          one  three
Tokyo       0      2
Kanagawa    4      6
Saitama     8     10
Chiba      12     14

In [39]:
#inplaceを使うと、削除したデータは完全になくなる。
data.drop('Tokyo',inplace=True)

print (data)

          one  two  three  four
Kanagawa    4    5      6     7
Saitama     8    9     10    11
Chiba      12   13     14    15

###2.6.2 条件で指定する

In [40]:
#性別男性の行に対してTrueを返す。
print (titanic.loc[:,'Sex']=='male')

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: Sex, Length: 891, dtype: bool

In [41]:
#上記のboole値を利用して性別男性のみ取得する
print (titanic[titanic.loc[:,'Sex']=='male'])

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
4              5         0       3  ...   8.0500   NaN         S
5              6         0       3  ...   8.4583   NaN         Q
6              7         0       1  ...  51.8625   E46         S
7              8         0       3  ...  21.0750   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
883          884         0       2  ...  10.5000   NaN         S
884          885         0       3  ...   7.0500   NaN         S
886          887         0       2  ...  13.0000   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[577 rows x 12 columns]

In [42]:
#GDP1兆ドル以上の国のみ抽出
print (gdp[gdp.loc[:,'GDP']>=1000000])

         GDP  GDP/pop
日本   4892255    38313
インド  1281330     1085
中国   4416104     3360

In [43]:
#平均より1人当たりGDPが高い国抽出
#平均算出 mに代入
m = np.mean(gdp['GDP/pop'].values)
print (gdp[gdp.loc[:,'GDP/pop']>=m])

             GDP  GDP/pop
日本       4892255    38313
韓国        931405    19343
サウジアラビア   475094    18853
シンガポール    188261    40793
香港        215354    30843

In [44]:
#女性のみのデータフレーム作成
titanic_female = titanic.loc[:,'Sex']=='female'
print (titanic_female)

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888     True
889    False
890    False
Name: Sex, Length: 891, dtype: bool

In [45]:
#指定した条件にあてはまったものに値を代入
#locの行参照にboole値を返す条件判定、列に指定列名
titanic_copy = titanic.copy()
titanic_copy.loc[titanic_copy.Age<20,'Age'] = 'Child'
print (titanic_copy['Age'])

0         22
1         38
2         26
3         35
4         35
       ...
886       27
887    Child
888      NaN
889       26
890       32
Name: Age, Length: 891, dtype: object

##2.7. 算術関数と要約統計量

###2.7.1. 算術関数

In [46]:
#サンプルデータとしてGDP/一人当たりGDP (100万ドル)作成
data = np.array([[4892255,38313],
                [1281330,1085],
                [510504,2246],
                [931405,19343],
                [475094	,18853],
                 [188261	,40793],
                  [272429	,4043],
                  [4416104,	3360],
                  [730325	,9881],
                  [146068	,825],
                  [79568	,497],
                  [167479	,1854],
                  [215354	,30843],
                  [221437	,8197]])

gdp = pd.DataFrame(data,columns=['GDP','GDP/pop'],
             index=['日本' ,'インド' ,'インドネシア','韓国', 'サウジアラビア','シンガポール', 'タイ',
'中国','トルコ', 'パキスタン','バングラデシュ', 'フィリピン','香港', 'マレーシア'])

#sum()メソッドで和を計算
print (gdp.sum())

GDP        14527613
GDP/pop      180133
dtype: int64

In [47]:
#列方向に和を計算
print (gdp.sum(axis=1))

日本         4930568
インド        1282415
インドネシア      512750
韓国          950748
サウジアラビア     493947
シンガポール      229054
タイ          276472
中国         4419464
トルコ         740206
パキスタン       146893
バングラデシュ      80065
フィリピン       169333
香港          246197
マレーシア       229634
dtype: int64

In [48]:
#平均計算
print (gdp.mean())
#平均列方向
print (gdp.mean(axis=1))

GDP        1.037687e+06
GDP/pop    1.286664e+04
dtype: float64
日本         2465284.0
インド         641207.5
インドネシア      256375.0
韓国          475374.0
サウジアラビア     246973.5
シンガポール      114527.0
タイ          138236.0
中国         2209732.0
トルコ         370103.0
パキスタン        73446.5
バングラデシュ      40032.5
フィリピン        84666.5
香港          123098.5
マレーシア       114817.0
dtype: float64

In [49]:
#最大値最小値 行方向
print (gdp.max())
print (gdp.min())

GDP        4892255
GDP/pop      40793
dtype: int64
GDP        79568
GDP/pop      497
dtype: int64

In [50]:
#最大の国は？ 行方向
print (gdp.idxmax())
#最小の国は？ 列方向
print (gdp.idxmin())

GDP            日本
GDP/pop    シンガポール
dtype: object
GDP        バングラデシュ
GDP/pop    バングラデシュ
dtype: object

###2.7.2. 加減乗除

In [52]:
df = pd.DataFrame(np.array([[0,4,4],[3,1,1]]),
                   index=['A','B'],columns=['a','b','c'])
print (df)

#列同士の計算（行同士は滅多にやらない）
#足し算
print (df.a + df.b) 
#引き算
print (df.a - df.b)
#掛け算
print (df.a * df.b)
#割り算
print (df.a / df.b)

   a  b  c
A  0  4  4
B  3  1  1
A    4
B    4
dtype: int64
A   -4
B    2
dtype: int64
A    0
B    3
dtype: int64
A    0.0
B    3.0
dtype: float64

In [53]:
#ドルを1ドル100円でJPYに直す
gdp*100

               GDP  GDP/pop
日本       489225500  3831300
インド      128133000   108500
インドネシア    51050400   224600
韓国        93140500  1934300
サウジアラビア   47509400  1885300
シンガポール    18826100  4079300
タイ        27242900   404300
中国       441610400   336000
トルコ       73032500   988100
パキスタン     14606800    82500
バングラデシュ    7956800    49700
フィリピン     16747900   185400
香港        21535400  3084300
マレーシア     22143700   819700

###2.7.3. 要約統計量

In [54]:
#min max などを一気に計算する
#データフレームのdescribeメソッド
gdp.describe()

                GDP       GDP/pop
count  1.400000e+01     14.000000
mean   1.037687e+06  12866.642857
std    1.572622e+06  14406.656734
min    7.956800e+04    497.000000
25%    1.950342e+05   1952.000000
50%    3.737615e+05   6120.000000
75%    8.811350e+05  19220.500000
max    4.892255e+06  40793.000000

In [55]:
#文字列数値混合しているデータフレームはデフォルトでは数値のみ
titanic.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [56]:
#文字列の場合 include='O'オプション
#文字列は数値と出力されるものが違う
titanic.describe(include='O')

                              Name   Sex    Ticket Cabin Embarked
count                          891   891       891   204      889
unique                         891     2       681   147        3
top     Backstrom, Mr. Karl Alfred  male  CA. 2343    G6        S
freq                             1   577         7     4      644

In [57]:
#数値文字列一緒に出力
#みやすいように.Tで転置させる
titanic.describe(include='all').T

            count unique                         top  ...      50%    75%      max
PassengerId   891    NaN                         NaN  ...      446  668.5      891
Survived      891    NaN                         NaN  ...        0      1        1
Pclass        891    NaN                         NaN  ...        3      3        3
Name          891    891  Backstrom, Mr. Karl Alfred  ...      NaN    NaN      NaN
Sex           891      2                        male  ...      NaN    NaN      NaN
Age           714    NaN                         NaN  ...       28     38       80
SibSp         891    NaN                         NaN  ...        0      1        8
Parch         891    NaN                         NaN  ...        0      0        6
Ticket        891    681                    CA. 2343  ...      NaN    NaN      NaN
Fare          891    NaN                         NaN  ...  14.4542     31  512.329
Cabin         204    147                          G6  ...      NaN    NaN      NaN
Embarked      889      3                           S  ...      NaN    NaN      NaN

[12 rows x 11 columns]

##2.8. 新しいカラムを作成する

In [58]:
#新しいカラムを作成 適当な値を代入
gdp['NewCol'] = 100
print (gdp)

             GDP  GDP/pop  NewCol
日本       4892255    38313     100
インド      1281330     1085     100
インドネシア    510504     2246     100
韓国        931405    19343     100
サウジアラビア   475094    18853     100
シンガポール    188261    40793     100
タイ        272429     4043     100
中国       4416104     3360     100
トルコ       730325     9881     100
パキスタン     146068      825     100
バングラデシュ    79568      497     100
フィリピン     167479     1854     100
香港        215354    30843     100
マレーシア     221437     8197     100

In [59]:
#一人当たりGDPとGDPから人口計算しpopカラムを作成
gdp['pop'] = gdp['GDP'] / gdp[('GDP/pop')]
print (gdp)

             GDP  GDP/pop  NewCol          pop
日本       4892255    38313     100   127.691776
インド      1281330     1085     100  1180.949309
インドネシア    510504     2246     100   227.294746
韓国        931405    19343     100    48.152045
サウジアラビア   475094    18853     100    25.199915
シンガポール    188261    40793     100     4.615032
タイ        272429     4043     100    67.382884
中国       4416104     3360     100  1314.316667
トルコ       730325     9881     100    73.912053
パキスタン     146068      825     100   177.052121
バングラデシュ    79568      497     100   160.096579
フィリピン     167479     1854     100    90.333873
香港        215354    30843     100     6.982265
マレーシア     221437     8197     100    27.014396

In [0]:
#popの単位を100万人から1人に戻す
gdp['pop'] = gdp['pop'] * 1000000

In [61]:
#GDPの全体平均に対しての比率
gdp['GDPMeanRatio'] = gdp['GDP'] / gdp['GDP'].mean()
print (gdp)

             GDP  GDP/pop  NewCol           pop  GDPMeanRatio
日本       4892255    38313     100  1.276918e+08      4.714578
インド      1281330     1085     100  1.180949e+09      1.234795
インドネシア    510504     2246     100  2.272947e+08      0.491964
韓国        931405    19343     100  4.815204e+07      0.897578
サウジアラビア   475094    18853     100  2.519992e+07      0.457840
シンガポール    188261    40793     100  4.615032e+06      0.181424
タイ        272429     4043     100  6.738288e+07      0.262535
中国       4416104     3360     100  1.314317e+09      4.255720
トルコ       730325     9881     100  7.391205e+07      0.703801
パキスタン     146068      825     100  1.770521e+08      0.140763
バングラデシュ    79568      497     100  1.600966e+08      0.076678
フィリピン     167479     1854     100  9.033387e+07      0.161397
香港        215354    30843     100  6.982265e+06      0.207533
マレーシア     221437     8197     100  2.701440e+07      0.213395

In [62]:
#人口1億人以上の国は1 それ以外0とするフラグカラム作成
#True/Falseをastype(int)でTrue→1 False→0とする
gdp['PopFlg'] = (gdp['pop']>=100000000).astype(int)
print (gdp)

             GDP  GDP/pop  NewCol           pop  GDPMeanRatio  PopFlg
日本       4892255    38313     100  1.276918e+08      4.714578       1
インド      1281330     1085     100  1.180949e+09      1.234795       1
インドネシア    510504     2246     100  2.272947e+08      0.491964       1
韓国        931405    19343     100  4.815204e+07      0.897578       0
サウジアラビア   475094    18853     100  2.519992e+07      0.457840       0
シンガポール    188261    40793     100  4.615032e+06      0.181424       0
タイ        272429     4043     100  6.738288e+07      0.262535       0
中国       4416104     3360     100  1.314317e+09      4.255720       1
トルコ       730325     9881     100  7.391205e+07      0.703801       0
パキスタン     146068      825     100  1.770521e+08      0.140763       1
バングラデシュ    79568      497     100  1.600966e+08      0.076678       1
フィリピン     167479     1854     100  9.033387e+07      0.161397       0
香港        215354    30843     100  6.982265e+06      0.207533       0
マレーシア     221437     8197     100  2.701440e+07      0.213395       0